app/Views/mastercustomer/edit.php

                      <input type="hidden" name="sales_id" id="salesIdInput" value="<?= $customer['sales_id'] ?? '' ?>">
                      <input type="text" id="salesNameInput" class="form-control" readonly placeholder="Pilih Sales..." style="flex:1;min-width:0;height:calc(2.25rem + 2px);" value="<?php if (isset($customer['sales_id'])) {
                                                                                                                                                                                        $db = \Config\Database::connect();
                                                                                                                                                                                        $sales = $db->table('mastersales')->where('id', $customer['sales_id'])->get()->getRowArray();
---
SELECT *
FROM `mastersales`
WHERE `id` = '0'