app/Controllers/Auth.php

    public function process()
    {
        // 1. Validasi input
        $rules = [
            'username'     => 'required',
            'password'     => 'required',
            'department_id' => 'required|integer',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        // 2. Ambil data dari form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $department_id = $this->request->getPost('department_id');

        // --- LOGIKA VALIDASI USER MULTI-DEPARTEMEN ---
        $userModel = new \App\Models\UserModel();
        $userDeptModel = new \App\Models\UserDepartmentModel();
        $user = $userModel->where('username', $username)->first();

        if ($user && password_verify($password, $user['password'])) {
            // Cek apakah user punya relasi ke departemen yang dipilih dan belum soft delete
            $userDept = $userDeptModel
                ->where('user_id', $user['id'])
                ->where('department_id', $department_id)
                ->where('deleted_at', null)
                ->first();
---
SELECT *
FROM "users"
WHERE "username" = 'geni1819'
 LIMIT 1
SELECT *
FROM "user_departments"
WHERE "user_id" = '909'
AND "department_id" = '3'
AND "deleted_at" IS NULL
AND "user_departments"."deleted_at" IS NULL
 LIMIT 1