app/Controllers/BatasTanggal.php

    public function index()
    {
        $model = new \App\Models\SystemDateLimitsModel();
        $data['batas'] = $model->orderBy('id', 'desc')->first();
---
SELECT *
FROM `system_date_limits`
ORDER BY `id` DESC
 LIMIT 1