app/Controllers/DiscountSettings.php

SELECT *
FROM "discount_settings"
---
    public function index()
    {
        $model = new DiscountSettingsModel();
        $settings = $model->findAll();