app/Controllers/MasterBarang.php

SELECT *
FROM `products`
WHERE `id` = 7
UPDATE `products` SET `nama_ky` = 'Genius Hartono'
WHERE `products`.`id` IN (7)
INSERT INTO `products` (`name`, `category_id`, `satuan_id`, `jenis_id`, `price`, `stock`, `nama_ky`, `warna_sinar_id`, `voltase_id`, `id`) VALUES ('Speaker Bass', '4', '4', '1', '23000', '15', 'Genius Hartono', '1', '1', 7)
---
    public function store()
    {
        $session = session();
        $nama_ky = $session->get('user_nama') ?? $session->get('user_username') ?? $session->get('nama') ?? $session->get('username') ?? 'unknown';
        $data = [
            'name' => $this->request->getPost('name'),
            'category_id' => $this->request->getPost('category_id'),
            'satuan_id' => $this->request->getPost('satuan_id'),
            'jenis_id' => $this->request->getPost('jenis_id'),
            'price' => $this->request->getPost('price'),
            'stock' => $this->request->getPost('stock'),
            'nama_ky' => $nama_ky,
        ];
        $klasifikasi = [
            'pelengkap_id', 'gondola_id', 'merk_id', 'warna_sinar_id', 'ukuran_barang_id', 'voltase_id', 'dimensi_id',
            'warna_body_id', 'warna_bibir_id', 'kaki_id', 'model_id', 'fiting_id', 'daya_id', 'jumlah_mata_id'
        ];
        foreach ($klasifikasi as $field) {
            $val = $this->request->getPost($field);
            if ($val) $data[$field] = $val;
        }
        $model = new \App\Models\MasterBarangModel();
        $model->insert($data);
        $id = $model->getInsertID();
        // Update nama_ky jika belum tersimpan (CodeIgniter kadang tidak simpan field custom di insert)
        $model->update($id, ['nama_ky' => $nama_ky]);
        $dataDb2 = $data;
        $dataDb2['id'] = $id;
        $db2 = \Config\Database::connect('db2');
        $exists = $db2->table('products')->where('id', $id)->get()->getRow();
        if ($exists) {
            $db2->table('products')->where('id', $id)->update($dataDb2);
        } else {
            $db2->table('products')->insert($dataDb2);