app/Controllers/MasterBarang.php

    public function edit($id)
    {
        $model = new \App\Models\MasterBarangModel();
        $barang = $model->find($id);
---
SELECT *
FROM `model`
WHERE `model`.`deleted_at` IS NULL