app/Controllers/MasterSales.php

    public function update($id)
    {
        $model = new MasterSalesModel();
        $data = [
            'kode' => $this->request->getPost('kode'),
            'nama' => $this->request->getPost('nama'),
            'alamat' => $this->request->getPost('alamat'),
            'tempat_lahir' => $this->request->getPost('tempat_lahir'),
            'no_hp' => $this->request->getPost('no_hp'),
            'no_ktp' => $this->request->getPost('no_ktp'),
            'status' => $this->request->getPost('status'),
        ];
        $model->update($id, $data);
        // Sync ke database kedua (db2)
        $db2 = \Config\Database::connect('db2');
        $dataDb2 = $data;
        $dataDb2['id'] = $id;
        $exists = $db2->table('mastersales')->where('id', $id)->get()->getRow();
        if ($exists) {
            $db2->table('mastersales')->where('id', $id)->update($dataDb2);
---
SELECT *
FROM `mastersales`
WHERE `id` = '4'
UPDATE `mastersales` SET `kode` = 'BONO', `nama` = 'BONU', `alamat` = 'CANGGU', `tempat_lahir` = 'Denpasar', `no_hp` = '0819292331312', `no_ktp` = '82124124128313', `status` = 'Menikah', `otoritas` = NULL, `updated_at` = '2025-08-09 08:20:30'
WHERE `mastersales`.`id` IN ('4')

    public function index()
    {
        $model = new MasterSalesModel();
        $search = $this->request->getGet('search');
        if ($search) {
            $model->groupStart()
                ->like('kode', $search)
                ->orLike('nama', $search)
                ->orLike('alamat', $search)
                ->orLike('tempat_lahir', $search)
                ->orLike('no_hp', $search)
                ->orLike('no_ktp', $search)
                ->orLike('status', $search)
            ->groupEnd();
        }
        $data['sales'] = $model->findAll();
---
SELECT *
FROM `mastersales`
WHERE `deleted_at` IS NULL
AND `mastersales`.`deleted_at` IS NULL
 LIMIT 10