app/Controllers/MasterCustomer.php

SELECT *
FROM `mastercustomer`
WHERE `mastercustomer`.`deleted_at` IS NULL
AND `mastercustomer`.`id` = '1'
---
    public function edit($id)
    {
        $model = new MasterCustomerModel();
        $data['customer'] = $model->find($id);

SELECT *
FROM `mastercustomer`
WHERE `id` = '1'
UPDATE `mastercustomer` SET `kode_customer` = 'TOYOTA', `nama_customer` = 'TOYOTA', `alamat` = 'Jl Gunung Sanghyang No 10', `contact_person` = 'Genius Hartono', `kota` = 'Badung', `provinsi` = 'Bali', `sales_id` = 'undefined', `no_hp` = '081906426886', `batas_piutang` = 93948949940000, `npwp_nomor` = '232443455443233', `npwp_atas_nama` = 'TOYOTA', `npwp_alamat` = 'Jl Gunung Sanghyang No 10', `updated_at` = '2025-08-11 08:35:01'
WHERE `mastercustomer`.`id` IN ('1')
---
    public function update($id)
    {
        $model = new MasterCustomerModel();
        $npwpNomorArr = $this->request->getPost('npwp_nomor');
        $npwpNomor = is_array($npwpNomorArr) ? implode('', $npwpNomorArr) : $npwpNomorArr;
        // Ambil dan parsing batas_piutang ke angka
        $batasPiutangInput = $this->request->getPost('batas_piutang');
        $batasPiutang = preg_replace('/[^0-9]/', '', $batasPiutangInput);
        $batasPiutang = $batasPiutang === '' ? 0 : (int)$batasPiutang;
        $data = [
            'kode_customer' => $this->request->getPost('kode_customer'),
            'nama_customer' => $this->request->getPost('nama_customer'),
            'alamat' => $this->request->getPost('alamat'),
            'contact_person' => $this->request->getPost('contact_person'),
            'kota' => $this->request->getPost('kota'),
            'provinsi' => $this->request->getPost('provinsi'),
            'sales' => $this->request->getPost('sales'),
            'no_hp' => $this->request->getPost('no_hp'),
            'batas_piutang' => $batasPiutang,
            'npwp_nomor' => $npwpNomor,
            'npwp_atas_nama' => $this->request->getPost('npwp_atas_nama'),
            'npwp_alamat' => $this->request->getPost('npwp_alamat'),
        ];
        $model->update($id, $data);
        // Sync ke database kedua (db2)
        $db2 = \Config\Database::connect('db2');
        $dataDb2 = $data;
        $dataDb2['id'] = $id;
        $exists = $db2->table('mastercustomer')->where('id', $id)->get()->getRow();
        if ($exists) {
            $db2->table('mastercustomer')->where('id', $id)->update($dataDb2);