app/Controllers/MasterDaya.php

SELECT *
FROM `daya`
WHERE `deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `daya`
WHERE `deleted_at` IS NULL
---
    public function index()
    {
        $model = new MasterDayaModel();
        $search = $this->request->getGet('search');
        $perPage = (int)($this->request->getGet('perPage') ?? 10);
        if ($perPage < 1) $perPage = 10;
        $builder = $model->where('deleted_at', null);
        if ($search) {
            $builder = $builder->like('name', $search);
        }
        $data['daya'] = $builder->paginate($perPage);