app/Controllers/MasterWarnaSinar.php

SELECT *
FROM `warna_sinar`
WHERE `deleted_at` IS NULL
AND `warna_sinar`.`deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `warna_sinar`
WHERE `deleted_at` IS NULL
AND `warna_sinar`.`deleted_at` IS NULL
---
    public function index()
    {
        $search = $this->request->getGet('search') ?? $this->request->getGet('keyword');
        $perPage = (int)($this->request->getGet('perPage') ?? 10);
        if ($perPage < 1) $perPage = 10;
        $builder = $this->masterWarnaSinarModel->where('deleted_at', null);
        if ($search) {
            $builder = $builder->like('name', $search);
        }
        $data['warnasinar'] = $builder->paginate($perPage);