app/Controllers/Penjualan.php

    public function pos()
    {
        // Ambil data sales, customer, barang, dan batas tanggal
        $db = \Config\Database::connect();
        $salesList = $db->table('mastersales')->where('deleted_at', null)->get()->getResultArray();
        $customerList = $db->table('mastercustomer c')
            ->select('c.*, s.id as sales_id, s.nama as sales_nama')
            ->join('mastersales s', 's.id = c.sales_id', 'left')
            ->where('c.deleted_at', null)
            ->get()->getResultArray();
        $barangList = $db->table('products')->where('deleted_at', null)->get()->getResultArray();
---
SELECT *
FROM `mastersales`
WHERE `deleted_at` IS NULL
SELECT `c`.*, `s`.`id` as `sales_id`, `s`.`nama` as `sales_nama`
FROM `mastercustomer` `c`
LEFT JOIN `mastersales` `s` ON `s`.`id` = `c`.`sales_id`
WHERE `c`.`deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `deleted_at` IS NULL