app/Controllers/Penjualan.php

    public function update($id)
    {
        // --- Awal patch: definisi variabel penting ---
        $db = \Config\Database::connect();
        $db2 = \Config\Database::connect('db2');
        $salesModel = new \App\Models\SalesModel();
        $maxNum = 999999999999999.99;
        $maxTenor = 9999;
        $salesItemModel = new \App\Models\SalesItemsModel();
        $deletedBarang = $this->request->getPost('deleted'); // array barang_id yang dihapus
        $barangIds = $this->request->getPost('barang_id');
        $qtys = $this->request->getPost('qty');
        $barangModel = new \App\Models\MasterBarangModel();
        // --- Akhir patch: definisi variabel penting ---

        // PATCH: Proses barang (soft delete dulu, baru insert barang baru)
        // 1. Soft delete barang yang dihapus
        if (!empty($deletedBarang)) {
            foreach ($deletedBarang as $barangIdDel) {
                $db->table('sales_items')->where(['sales_id' => $id, 'product_id' => $barangIdDel, 'deleted_at' => null])->update(['deleted_at' => date('Y-m-d H:i:s')]);
                $db2->table('sales_items')->where(['sales_id' => $id, 'product_id' => $barangIdDel, 'deleted_at' => null])->update(['deleted_at' => date('Y-m-d H:i:s')]);
            }
        }
        // 2. Insert barang baru (deleted_at null)
        // Ambil semua barang lama yang masih aktif
        $existingItems = $salesItemModel->where(['sales_id' => $id, 'deleted_at' => null])->findAll();
---
SELECT *
FROM "sales_items"
WHERE "sales_id" = '13'
AND "sales_items"."deleted_at" IS NULL

    public function edit($id)
    {
        $penjualanModel = new \App\Models\PenjualanModel();
        $salesModel = new \App\Models\SalesModel();
        $db = \Config\Database::connect();
        $db2 = \Config\Database::connect('db2');
        $maxNum = 999999999999999.99;
        $maxTenor = 9999;
        $penjualan = $salesModel->find($id);
        if (!$penjualan) {
            return redirect()->to('/penjualan/datapenjualan')->with('error', 'Data penjualan tidak ditemukan.');
        }
        // Ambil data customer, sales, barang, dll
        $db = \Config\Database::connect();
        $customerId = $penjualan['customer_id'] ?? $penjualan['customer'] ?? null;
        $customer = $db->table('mastercustomer')->where('id', $customerId)->get()->getRowArray();
        $salesId = $penjualan['sales_id'] ?? $penjualan['sales'] ?? null;
        $sales = $db->table('mastersales')->where('id', $salesId)->get()->getRowArray();
        $penjualan['customer_nama'] = $customer['nama_customer'] ?? '';
        $penjualan['sales_nama'] = $sales['nama'] ?? '';
        $customerList = $db->table('mastercustomer c')
            ->select('c.*, s.id as sales_id, s.nama as sales_nama')
            ->join('mastersales s', 's.id = c.sales_id', 'left')
            ->where('c.deleted_at', null)
            ->get()->getResultArray();
        $salesList = $db->table('mastersales')->where('deleted_at', null)->get()->getResultArray();
        $barangList = $db->table('products')->where('deleted_at', null)->get()->getResultArray();
---
SELECT *
FROM "sales"
WHERE "sales"."deleted_at" IS NULL
AND "sales"."id" = '24'
SELECT *
FROM "mastercustomer"
WHERE "id" = '2'
SELECT *
FROM "mastersales"
WHERE "id" = '2'
SELECT "c".*, "s"."id" as "sales_id", "s"."nama" as "sales_nama"
FROM "mastercustomer" "c"
LEFT JOIN "mastersales" "s" ON "s"."id" = "c"."sales_id"
WHERE "c"."deleted_at" IS NULL
SELECT *
FROM "mastersales"
WHERE "deleted_at" IS NULL
SELECT *
FROM `mastercustomer`
WHERE `deleted_at` IS NULL
AND `mastercustomer`.`deleted_at` IS NULL
SELECT *
FROM `mastersales`
WHERE `deleted_at` IS NULL
AND `mastersales`.`deleted_at` IS NULL
SELECT *
FROM "products"
WHERE "products"."deleted_at" IS NULL
AND "products"."id" = '2'

        file_put_contents(ROOTPATH . 'writable/logs/batas_tanggal.log', "EDITPOS: min=" . ($batasTanggal['min'] ?? 'null') . "\n", FILE_APPEND);
        // Ambil item barang dari sales_items dan join ke products
        $salesItemModel = new \App\Models\SalesItemsModel();
        $itemsRaw = $salesItemModel->where('sales_id', $id)->findAll();
---
SELECT *
FROM "sales_items"
WHERE "sales_id" = '24'
AND "sales_items"."deleted_at" IS NULL

        foreach ($itemsRaw as $item) {
            // Filter hanya barang yang belum dihapus (deleted_at == null)
            if (!isset($item['deleted_at']) || $item['deleted_at'] === null) {
                $barang = $productModel->find($item['product_id']);
---
SELECT *
FROM `products`
WHERE `deleted_at` IS NULL
AND `products`.`deleted_at` IS NULL

    public function pos()
    {
        $nomor_nota = $this->request->getGet('nomor_nota');
        if (!$nomor_nota) {
            $nomor_nota = 'INV-' . date('Ymd') . '-' . strtoupper(substr(md5(uniqid(rand(), true)), 0, 5));
        }
        $db = \Config\Database::connect();
        $salesList = $db->table('mastersales')->where('deleted_at', null)->get()->getResultArray();
        $customerList = $db->table('mastercustomer c')
            ->select('c.*, s.id as sales_id, s.nama as sales_nama')
            ->join('mastersales s', 's.id = c.sales_id', 'left')
            ->where('c.deleted_at', null)
            ->get()->getResultArray();
        $barangList = $db->table('products')->where('deleted_at', null)->get()->getResultArray();
---
SELECT *
FROM "mastersales"
WHERE "deleted_at" IS NULL
SELECT "c".*, "s"."id" as "sales_id", "s"."nama" as "sales_nama"
FROM "mastercustomer" "c"
LEFT JOIN "mastersales" "s" ON "s"."id" = "c"."sales_id"
WHERE "c"."deleted_at" IS NULL
SELECT *
FROM "products"
WHERE "deleted_at" IS NULL