app/Controllers/User.php

    public function index()
    {
        $userModel = new UserModel();
        $userDepartmentModel = new \App\Models\UserDepartmentModel();
        $departmentModel = new \App\Models\DepartmentModel();
        $search = $this->request->getGet('search');
        $perPage = (int)($this->request->getGet('perPage') ?? 10);
        if ($perPage < 1) $perPage = 10;
        $builder = $userModel->where('deleted_at', null);
        if ($search) {
            $builder = $builder->groupStart()
                ->like('nama', $search)
                ->orLike('username', $search)
                ->orLike('alamat', $search)
                ->orLike('noktp', $search)
                ->groupEnd();
        }
        $data['users'] = $builder->paginate($perPage);
---
SELECT *
FROM `users`
WHERE `deleted_at` IS NULL
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `deleted_at` IS NULL