app/Models/PenjualanModel.php

    public function getData($keyword = null)
    {
        $builder = $this->db->table('sales')
            ->select('sales.*, mastercustomer.nama_customer, mastersales.nama as nama_sales')
            // Join tanpa type cast, asumsikan kolom sales.customer dan sales.sales bertipe integer
            ->join('mastercustomer', 'mastercustomer.id = sales.customer', 'left')
            ->join('mastersales', 'mastersales.id = sales.sales', 'left')
            ->where('sales.deleted_at', null);
        if ($keyword) {
            $builder->groupStart()
                ->like('sales.nomor_nota', $keyword)
                ->orLike('mastercustomer.nama_customer', $keyword)
                ->orLike('mastersales.nama', $keyword)
                ->groupEnd();
        }
        return $builder->get()->getResultArray();
---
SELECT "sales".*, "mastercustomer"."nama_customer", "mastersales"."nama" as "nama_sales"
FROM "sales"
LEFT JOIN "mastercustomer" ON "mastercustomer"."id" = "sales"."customer"
LEFT JOIN "mastersales" ON "mastersales"."id" = "sales"."sales"
WHERE "sales"."deleted_at" IS NULL