app/Models/SystemDateLimitsModel.php

SELECT *
FROM `system_date_limits`
ORDER BY `id` DESC
 LIMIT 1
---
    public function getBatasTanggal()
    {
        $row = $this->orderBy('id', 'desc')->first();