app/Controllers/otorisasi_klasifikasi/OtorisasiKategori.php

SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT `id`, `name`, `description`, `otoritas`
FROM `categories`
 LIMIT 10
---
    public function index()
    {
        $categoryModel = new OtorisasiKategoriModel();
        $perPage = (int)($this->request->getGet('perPage') ?? 10);
        $keyword = $this->request->getGet('search');
        $query = $categoryModel->select('id, name, description, otoritas')
            ->where('deleted_at', null);
        if ($keyword) {
            $query = $query->like('name', $keyword);
        }
        $data = [
            'categories' => $query->paginate($perPage, 'default'),
            'pager' => $categoryModel->pager,
            'perPage' => $perPage,
            'search' => $keyword,
        ];