app/Controllers/otorisasi_klasifikasi/OtorisasiDimensi.php

    public function index()
    {
        $model = new MasterDimensiModel();
        $perPage = (int)($this->request->getGet('perPage') ?? 10);
        $keyword = $this->request->getGet('search');
        $query = $model->select('id, name, otoritas')
            ->where('deleted_at', null);
        if ($keyword) {
            $query = $query->like('name', $keyword);
        }
        $data = [
            'dimensi' => $query->paginate($perPage, 'default'),
            'pager' => $model->pager,
            'perPage' => $perPage,
            'search' => $keyword,
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `dimensi`
WHERE `dimensi`.`deleted_at` IS NULL
SELECT `id`, `name`, `otoritas`
FROM `dimensi`
WHERE `dimensi`.`deleted_at` IS NULL
 LIMIT 10